import { html, render } from "./node_modules/lit-html/lit-html.js";

const housesTemplate = () => html`
  <div class="header-container houses">
    <div>
      <h1>
        Сглобяеми<br />
        къщи
      </h1>
    </div>
  </div>
  <section class="houses">
    <div class="houses-main">
      <div class="houses-image-holder"></div>
      <div class="houses-main-text">
        <h2>Нашите предимства</h2>
        <div>
          <i class="fa-solid fa-brush"></i>
          <div>
            <h5>Гъвкавост и Персонализация</h5>
            <p>
              Модерн Хаус ООД. проектират къщите с оглед на вашите уникални
              изисквания. Можете да персонализирате размера, дизайна и
              материалите, за да получите идеалната къща за вас.
            </p>
          </div>
        </div>
        <div>
          <i class="fa-solid fa-trowel-bricks"></i>
          <div>
            <h5>Бърз Монтаж</h5>
            <p>
              Сглобяемите къщи се поставят значително по-бързо в сравнение с
              традиционното строителство. Това ви позволява да бъдете в новия си
              дом в кратък срок и да се наслаждавате на комфорта му.
            </p>
          </div>
        </div>
        <div>
          <i class="fa-solid fa-hand-fist"></i>
          <div>
            <h5>Издръжливост и Ефективност</h5>
            <p>
              Материалите и технологиите които използваме гарантират висока
              ефективност и издръжливост на сглобяемите къщи. Те са създадени,
              за да ви предоставят комфорт през цялата година.
            </p>
          </div>
        </div>
        <div>
          <i class="fa-solid fa-piggy-bank"></i>
          <div>
            <h5>Инвестиция с Бъдеще</h5>
            <p>
              Инвестирането в сглобяема къща представлява стабилно и разумно
              решение за вашето бъдеще. Те запазват стойността си и се адаптират
              към променящите се нужди.
            </p>
          </div>
        </div>
      </div>
    </div>
    <div class="houses-footer">
      <h3>
        За да ви предоставим максимална гъвкавост и възможност за
        персонализация, ние предлагаме два вида завършеност за нашите сглобяеми
        къщи, като има възможност и до ключ.
      </h3>
      <div class="houses-footer-container">
        <div
          class="houses-footer-image"
          style="background-image: url(./asets/houses/36@2x.png);"
        ></div>
        <div class="houses-footer-text">
          <div class="number one">1</div>
          <h3>До метална конструкция</h3>
          <p>
            При нас разбираме, че всеки клиент има свои уникални предпочитания и
            изисквания за своята къща. Затова, когато става въпрос за
            изграждането на метална конструкция, ние вярваме в индивидуалния
            подход и възможността за персонализация. Всеки проект, който
            приемаме, представлява уникално предизвикателство, и ние се стремим
            да го реализираме с максимално внимание към детайлите
          </p>
        </div>
      </div>
      <div class="houses-footer-container" style="justify-content: flex-end;">
        <div class="houses-footer-text">
          <h3>Изолирана и Облицована</h3>
          <p>
            <strong>Външните стени</strong> са с дебелина от 15 см, като в този
            слой се включва ОСБ с минерална мазилка, което осигурява изолация и
            устойчивост на външните влияния.<br /><strong
              >Вътрешните стени</strong
            >
            са с дебелина от 10 см, като и двете страни са облицовани с 14 см
            каменна вата и 2 слоя гипсокартон. Това осигурява отлична
            звукоизолация и комфорт във вашия дом.<br />За
            <strong>тавана</strong> сме избрали гипсокартон и 10 см каменна
            вата, което не само увеличава енергийната ефективност на къщата, но
            и подобрява звуковата изолация и усещането за уют.<br />Вашият
            <strong>покрив</strong> е облицован със стоманени керемиди, с
            дебелина от 0.5 см,
          </p>
          <div class="number two">2</div>
        </div>
        <div
          class="houses-footer-image"
          style="background-image: url(./asets/houses/67@2x.png);"
        ></div>
      </div>
    </div>
  </section>
`;

export default function renderHouses() {
  let result = housesTemplate();
  return result;
}
