import { html, render } from "./node_modules/lit-html/lit-html.js";

const steelHouseArr = [
  {
    foors: 1,
    total: 47,
    rooms: [
      ["Хол + кухня", "20"],
      ["Баня", "5"],
      ["Антре", "5"],
      ["Спалня", "10"],
      ["Веранда", "7"],
    ],
  },
  {
    foors: 1,
    total: 50,
    rooms: [
      ["Хол + кухня", "24"],
      ["Баня", "5"],
      ["Антре", "3"],
      ["Спалня", "12"],
      ["Веранда", "6"],
    ],
  },
  {
    foors: 1,
    total: 68,
    rooms: [
      ["Хол + кухня", "18"],
      ["Баня", "5"],
      ["Антре", "6"],
      ["Спалня 1", "12"],
      ["Спалня 2", "12"],
      ["Веранда", "15"],
    ],
  },
  {
    foors: 1,
    total: 97,
    rooms: [
      ["Хол", "25"],
      ["Кухня", "10"],
      ["Баня", "5"],
      ["Антре", "12"],
      ["Спалня 1", "15"],
      ["Спалня 2", "10"],
      ["Веранда", "20"],
    ],
  },
  {
    foors: 1,
    total: 106,
    rooms: [
      ["Хол", "28"],
      ["Кухня", "12"],
      ["Баня", "8"],
      ["Антре", "12"],
      ["Спалня 1", "16"],
      ["Спалня 2", "12"],
      ["Спалня 3", "10"],
      ["Веранда", "8"],
    ],
  },
  {
    foors: 2,
    total: 117,
    rooms: [
      ["Хол", "25"],
      ["Кухня", "10"],
      ["Баня", "4"],
      ["Антре", "13"],
      ["Тераса", "4"],
    ],
    rooms2: [
      ["Спалня 1", "15"],
      ["Спалня 2", "10"],
      ["Спалня 3", "10"],
      ["Баня", "7"],
      ["Антре", "6"],
      ["Тераса", "4"],
    ],
  },
];

const SingleSteelHouseTemplate = (item, index) => html`
  <section class="single-steel-house">
    <div class="house-details">
      <div class="house-blueprint">
        <p>${item.total}&#13217;</p>
        <img
          src="./asets/steel-houses/steel-houses-details/${index}.webp"
          alt=""
        />
      </div>
      <div class="table-holder">
        <table>
          <tr>
            <td>Етаж 1</td>
          </tr>
          ${item.rooms.map((room) => setTableRows(room))}
        </table>
      </div>
    </div>
    ${item.rooms2
      ? html`
          <div class="house-details">
            <div class="house-blueprint">
              <img
                src="./asets/steel-houses/steel-houses-details/6-1.webp"
                alt=""
              />
            </div>
            <div class="table-holder">
              <table>
                <tr>
                  <td>Етаж 2</td>
                </tr>
                ${item.rooms2.map((room) => setTableRows(room))}
              </table>
            </div>
          </div>
        `
      : ""}
    <div class="horizontal-separator"></div>
    <div class="steel-house-info">
      <h2>Описание</h2>
      <p>
        Поцинкована лека стоманена ламарина, чиято дебелина варира от 0,8 mm до
        1,6 mm, се обработва от машини за студено валцуване и от нея се
        произвеждат профили, подходящи за статични изчисления. Тези профили се
        свързват с винтове и нитове без заваряване и се оформя скелетът на
        конструкцията. Скелетът на конструкцията, който включва стените, пода и
        покривната конструкция, е изключително здрав и с подходящо покритие.<br />
        Фундаментът има височина 30 cm от нивото на земята и включва опростена
        система от опорни греди. Носещите стени са анкерирани към бетонните
        греди. Останалите пространства се запълват с инертен материал.
        Фундаментът се изгражда чрез изливане на бетон в стоманена армировъчна
        мрежа.
      </p>
    </div>
    <div class="steel-house-info">
      <h2>ХАРАКТЕРИСТИКИ НА КОНСТРУКЦИЯТА</h2>
      <p>
        Вътрешни стени <br />• 140 mm скелетна конструкция от валцована стомана
        от машинно изтеглен С-образен профил; <br />• Изолация от минерална вата
        вътре в рамката от С-образен профил; <br />• Облицовъчни плоскости от
        Betopan / Boardex / OSB / Tassoonite / дървен фурнир и т.н.; <br />• В
        зависимост от проекта, за предпочитане е обшивка от минерална вата – 5
        cm. Вътрешни стени <br />• 90 mm скелетна конструкция от валцована
        стомана от машинно изтеглен С-образен профил; <br />• 60 mm Изолация от
        минерална вата вътре в рамката от С-образен профил; <br />• Облицовъчни
        плоскости от Betopan / Boardex / OSB / гипсокартон; <br />• Гипсова
        шпакловка; <br />• Полагане на боя или тапети в съответствие с проекта.
        Покривна конструкция <br />• Приложение на OSB плоскости върху стоманена
        покривна скелетна конструкция; <br />• Хидроизолационна мембрана;
        <br />• Покрив от керемиди / метални плочи / каменни плочи / сандвич
        панели. Тавани <br />• Изолация от стъклена вата в стоманени таванни
        панели; <br />• Полагане на таванни плоскости от гипсокартон; <br />•
        Нанасяне на боя или поставяне на плочки 60 x 60. Всички варианти на
        материалите, като покритие, изолация и аксесоари, могат да се променят
        според проекта и предпочитанията на клиента.
      </p>
    </div>
  </section>
  <div class="solo-a">
    <a href="#steel-houses">
      <button id="back-btn">
        <i class="fa-solid fa-chevron-left"></i>
        Назад
      </button></a
    >
  </div>
`;

const setTableRows = (item) => html`
  <tr>
    <td>${item[0]}</td>
    <td>${item[1]} &#13217;</td>
  </tr>
`;

export default function SingleSteelHouseRender(index) {
  let result = SingleSteelHouseTemplate(steelHouseArr[index - 1], index);
  return result;
}
