import { html, render } from "./node_modules/lit-html/lit-html.js";
const steelHousesArr = [1, 2, 3, 4, 5, 6];
const sizesArr = [47, 50, 68, 97, 106, 117];
const steelHousesView = () => html`
    <div class="header-steel-house header-container">
      <div>
        <h1>Стоманени<br> къщи</h1>
      </div>
    </div>
    <section class="steel-houses-gallery">
      ${steelHousesArr.map((item) => singleHouse(item))}
    </section>
    <section class="steel-house-footer">
      <div class="steel-haouse-descreption">
        <h3>Здравина</h3>
        <p>
          Предварително произведените носещи елементи осигуряват високо качество
          на ниска цена и съкращават времето за изграждане. Стоманата е
          материалът, който има най-добро съотношение тегло – носимоспособност.
          Благодарение на високата носимоспособност на стоманата, стоманените
          строителни елементи се произвеждат с по-малки сечения и размери,
          по-леки и с отлични качества. Балансираната цена и кратките срокове за
          строителство позволяват на хората да се нанесат по-бързо, което им
          дава възможност за по-малко разходи за наеми и лихви и поголяма
          икономическа ефективност.
        </p>
      </div>
      <div class="steel-haouse-descreption">
        <h3>Устойчивост на земетресения</h3>
        <p>
          Стоманата е най-издръжливият на земетресения строителен материал
          поради високата си якост, гъвкавост и ниско тегло. Ниското тегло му
          позволява да устои на удар. Единственият фактор, който ще намали
          земетръсната сила, е облекчаването на конструкцията. Колкото по-голяма
          е масата на конструкцията, толкова по-голяма сила ще упражни
          земетресението върху нея. Стоманените къщи са 5 пъти по-леки от тези
          със стоманобетонна конструкция. Това означава, че земетръсното
          натоварване на сградата е 5 пъти по-малко.
        </p>
      </div>
      <div class="steel-haouse-descreption">
        <h3>Високо качество</h3>
        <p>
          Качеството на стоманата, която е напълно промишлен продукт с
          международно определени спецификации, се проверява и документира на
          всеки етап от производството. Производителят или потребителят не може
          да се намесва във физическите свойства на материала. Теоретичните
          стойности се прилагат и на практика. Тъй като материалът не е скрит в
          бетон, има гаранция, че спазването на проекта и стандартите може да
          бъде наблюдавано по всяко време.
        </p>
      </div>
    </section>
  </div>
`;

const singleHouse = (index) => html`
  <div class="steel-house-container">
    <div class="image-steel-house-holder">
      <img src="./asets/steel-houses/${index}.webp" alt="" />
    </div>
    <div class="text-steel-house-holder">
      <p>${sizesArr[index - 1]} &#13217;</p>
      <a href="#steel-houses/${index}">Преглед</a>
    </div>
  </div>
`;

export default function renderSteelHousesView() {
  let result = steelHousesView();
  return result;
}
